// pages/protocol/protocol.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    html:`<h4>一、定义条款</h4>
        <ol>
            <li><span>1.1.</span>“团购”：通过互联网渠道，一定数量的消费者组团，以较低价格购买同一种商品/服务的商业活动。</li>
            <li><span>1.2.</span>“美团网”：北京三快科技有限公司运营和管理的网络交易平台，域名为www.meituan.com, 北京三快科技有限公司通过该网络交易平台为用户和商家提供进行团购交易的网络交易平台服务。本协议下文中，“美团网”既指网络交易平台（www.meituan.com），亦指北京三快科技有限公司。</li>
            <li><span>1.3.</span>“用户”：接受并同意本协议全部条款及美团网发布的其他全部服务条款和操作规则、通过美团网进行团购交易的美团网注册会员。</li>
            <li><span>1.4.</span>“商家”：通过美团网发布团购商品/服务信息、向用户提供团购商品/服务的自然人、法人和其他组织。</li>
            <li><span>1.5.</span>“团购交易”：用户与商家通过美团网进行的交易团购商品/服务的活动。</li>
            <li><span>1.6.</span>“团购信息”：商家通过美团网发布的，在美团网页面上展示的团购商品/服务信息，包括但不限于团购商品/服务的名称、促销优惠（包括但不限于折扣券、抵用券、红包等）、种类、数量、质量、价格、有效期、预约时间、商家地址、配送方式、退换货方式、退款条件、售后服务等内容。团购信息在法律上构成商家就团购商品/服务向用户发出的要约。</li>
            <li><span>1.7.</span>“团购价款”：用户为购买团购商品/服务而应向商家支付的团购商品/服务的对价，团购价款的数额以用户与商家达成的团购订单中约定的团购价格及团购数量为确定依据。</li>
            <li><span>1.8.</span>“团购电子消费凭证”：由美团网以页面、短信、电子邮件或其他方式向用户发送的电子形式的购货凭证或服务单据，内容为美团券密码或二维码等（具体根据团购订单确定），用于证明用户已支付团购价款、有权获得所购买的团购商品/服务。</li>
        </ol>
        <h4>二、用户注册</h4>
        <ol id="yui_3_16_0_1_1526622947676_582">
            <li id="yui_3_16_0_1_1526622947676_581"><span>2.1.</span>注册资格
                <p id="yui_3_16_0_1_1526622947676_580">用户承诺：用户具有完全民事权利能力和行为能力或虽不具有完全民事权利能力和行为能力但经其法定代理人同意并由其法定代理人代理注册及应用美团网服务。</p>
            </li>
            <li><span>2.2.</span>注册目的
                <p>用户承诺：用户进行用户注册并非出于违反法律法规或破坏美团网网络团购交易秩序的目的。</p>
            </li>
            <li><span>2.3.</span>注册流程
                <ol>
                    <li><span>2.3.1.</span>用户同意根据美团网用户注册页面的要求提供有效电子邮箱、所在城市等信息，设置美团网账号及密码，用户应确保所提供全部信息的真实性、完整性和准确性。</li>
                    <li><span>2.3.2.</span>用户在注册时有权选择是否订阅美团网发送的关于团购信息的电子邮件和/或短信息。</li>
                    <li><span>2.3.3.</span>用户合法、完整并有效提供注册所需信息的，有权获得美团网账号和密码，美团网账号和密码用于用户在美团网进行会员登录。</li>
                    <li><span>2.3.4.</span>用户获得美团网账号及密码时视为用户注册成功，用户同意接收美团网发送的与美团网网站管理、运营相关的电子邮件和/或短消息。</li>
                </ol>
            </li>
        </ol>
        <h4>三、用户服务</h4>
        <p>美团网为用户通过美团网进行网络团购交易活动提供网络交易平台服务，美团网将根据市场需要，结合各业务部门的不同特点，可能向用户收取一定的服务费用。</p>
        <ol>
            <li><span>3.1.</span>服务内容
                <ol>
                    <li><span>3.1.1.</span>用户有权在美团网浏览团购商品/服务的团购信息、有权通过美团网与商家达成团购订单、支付团购价款、获得团购电子消费凭证（如有）等。</li>
                    <li><span>3.1.2.</span>用户有权在美团网查看其美团网会员账号下的信息，有权应用美团网提供的功能进行操作。</li>
                    <li><span>3.1.3.</span>用户有权按照美团网发布的活动规则参与美团网组织的网站活动。</li>
                    <li><span>3.1.4.</span>美团网承诺为用户提供的其他服务。</li>
                </ol>
            </li>
            <li><span>3.2.</span>服务规则
                <p>用户承诺遵守下列美团网服务规则：</p>
                <ol>
                    <li><span>3.2.1.</span>用户应当遵守法律法规、规章、规范性文件及政策要求的规定，不得在美团网或利用美团网服务从事非法或其他损害美团网或第三方权益的活动，如发送或接收任何违法、违规、违反公序良俗、侵犯他人权益的信息，发送或接收传销材料或存在其他危害的信息或言论，未经美团网授权使用或伪造美团网电子邮件题头信息等。</li>
                    <li><span>3.2.2.</span>用户应当遵守法律法规应当谨慎合理使用和妥善保管美团网账号及密码，对其美团网账号和密码下进行的行为和发生的事件负责。当用户发现美团网账号被未经其授权的第三方使用或存在其他账号安全问题时应立即有效通知美团网，要求美团网暂停该美团网账号的服务，并向公安机关报案。美团网有权在合理时间内对用户的该等请求采取行动，但对采取行动前用户已经遭受的损失不承担任何责任。用户在未经美团网同意的情况下不得将美团网账号以赠与、借用、租用、转让或其他方式处分给他人。</li>
                    <li><span>3.2.3.</span>用户通过美团网与商家进行团购交易时，应当遵守本协议“团购交易规则”的全部约定及美团网发布的其他关于团购交易的服务条款和操作规则的全部规定。</li>
                    <li><span>3.2.4.</span>用户在美团网对团购商品/服务进行评价时应当根据实际情况如实进行评价。</li>
                    <li><span>3.2.5.</span>用户应当按照美团网发布的规则参加美团网抽奖等活动，遵守活动秩序。</li>
                    <li><span>3.2.6.</span>美团网发布的其他服务条款和操作规则。</li>
                </ol>
            </li>
        </ol>`
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})